# ElementsInInvalidContext Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericFailures..::..ElementsInInvalidContext Property
BuiltInFailures..::..GenericFailures Class See Also
---
There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsInInvalidContext { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsInInvalidContext As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsInInvalidContext {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericFailures Class
Autodesk.Revit.DB Namespace